// Напишите программу, которая на вход принимает два числа и выдаёт,
// какое число большее, а какое меньшее. 
Console.Write("Введите число A: ");
int A = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число B: ");
int B = Convert.ToInt32(Console.ReadLine());
if (A > B)Console.WriteLine(" A больше B");
if (A < B)Console.WriteLine(" A меньше B ");
if (A == B)Console.WriteLine(" A равно B ");

